**Terraform Format and Style 🖌**
`success`

**Terraform Initialization ⚙️**
`success`

**Terraform Validate ✅**
`success`

**Terraform Plan 📖**
`success`

<details><summary>Show Plan</summary>

```
terraform
hcloud_floating_ip.bastion: Refreshing state... [id=369139]
hcloud_ssh_key.default: Refreshing state... [id=2415045]
hcloud_network.internal: Refreshing state... [id=453488]
hcloud_network_subnet.internal: Refreshing state... [id=453488-10.0.0.0/24]
hcloud_server.bastion: Refreshing state... [id=9411698]
hcloud_server_network.bastion: Refreshing state... [id=9411698-453488]
hcloud_floating_ip_assignment.bastion: Refreshing state... [id=369139]
google_dns_record_set.bastion: Refreshing state... [id=mhnet-me/bastion.fsn1.mhnet.me./A]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_floating_ip_assignment.bastion must be replaced
-/+ resource "hcloud_floating_ip_assignment" "bastion" {
      ~ id             = "369139" -> (known after apply)
      ~ server_id      = 9411698 -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # hcloud_server.bastion must be replaced
-/+ resource "hcloud_server" "bastion" {
      + backup_window = (known after apply)
      ~ datacenter    = "fsn1-dc14" -> (known after apply)
      ~ id            = "9411698" -> (known after apply)
      ~ ipv4_address  = "159.69.178.6" -> (known after apply)
      ~ ipv6_address  = "2a01:4f8:c17:ea64::1" -> (known after apply)
      ~ ipv6_network  = "2a01:4f8:c17:ea64::/64" -> (known after apply)
      - labels        = {} -> null
        name          = "bastion.fsn1.mhnet.me"
      ~ ssh_keys      = [
          - "2415045",
        ] -> (known after apply) # forces replacement
      ~ status        = "running" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # hcloud_server_network.bastion must be replaced
-/+ resource "hcloud_server_network" "bastion" {
      - alias_ips   = [] -> null
      ~ id          = "9411698-453488" -> (known after apply)
      ~ mac_address = "86:00:00:8b:e7:c9" -> (known after apply)
      ~ server_id   = 9411698 -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # hcloud_ssh_key.default will be created
  + resource "hcloud_ssh_key" "default" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIfm1yYW1eWfyHGTHVgtgP2P2yY5otmHnSWUWEyNk23f"
    }

Plan: 4 to add, 0 to change, 3 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```
</details>
Pusher: @mhutter
Action: `pull_request`